# CanLayerWidthBeNonZero Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..CanLayerWidthBeNonZero Method
CompoundStructure Class See Also
---
Identifies if changing the width of an existing layer from zero to a positive value will create a rectangular region.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool CanLayerWidthBeNonZero(
	int layerIdx
)
```

Visual Basic
---
```text
Public Function CanLayerWidthBeNonZero ( _
	layerIdx As Integer _
) As Boolean
```

Visual C++
---
```text
public:
bool CanLayerWidthBeNonZero(
	int layerIdx
)
```

# ### Parameters
layerIdx
    Type: System..::..Int32 The index of a CompoundStructureLayer.
# Remarks
This is only allowed if there is a vertical line such that all regions to the left are assigned to layers with index < layerIdx, and all regions to the right are assigned to layers with index > layerIdx.
# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace